#456e74657220666c61672028686578656e636f646564293a206f657072617673756172757170747269706568636c727862797a6c6a66736e7061726469656f144a0a0b14545e43535c484042404642093b2226230e414b43445d0c5154404155145642050a120c2304111a141c220517030813241621071e0d180f2025000a06010e1b1f1910090b151d02
import sys
_0 = sys.argv[0] # видим вот это (файл читает сам себя), вспоминаем про коммент в оригинальном файле, добавляем в начало файла
_1 = open(_0).read()
_16 = _1[1:51]
_2 = _1[51:127]
_3 = _1[127:203]
_4 = _1[203:279]
_5 = bytes.fromhex(_2)
_6 = bytes.fromhex(_3)
_7 = bytes.fromhex(_4)
_8 = ''.join([_2[1]+str(type(''))[0xa]+str(type(1j+.1))[9]+min.__name__[0]+hash.__name__[0]+_2[::list(range(5))[0]-1][-62]+hex.__name__[bool(id(1))-2]])
_9 = getattr(bytes, _8)
_10 = _9(input(bytes.fromhex(_16).decode()))
_11 = (_6[:5][::-1]+_6[5:13][::-1]+_6[13:17][::-1]+_6[17:][::-1])[::-1]
_12 = bytes([bytes([_5[_15] for _15 in _7])[i] for i in _7])
print(_12)
_13 = bytes(_10[_14]^_11[_14] for _14 in range(((not False)+True)**int(_6.hex()[0xa])+(True+True)*(len('UCTF'[:-1]))))
print(_12==_13) # видим сравнение, видим, что _12 не зависит от инпута, выводим в консоль
#дальше деобфусцируем ручками (stage2.py)